#файл с общими штуками типа фикстур и хуки (шо такое - будет потом занятие)
#то, что лежит здесь - используется для всего проекта
#ща закомменчено чтобы не мешало

#import pytest

#@pytest.fixture(scope="session", autouse=True) #вызывается в любом случае, типа глобальная
#def open_browser():
#    print("Я - фикстура, выполняюсь перед тестом!") #setup то, что выполняется перед тестом
#    yield #тут выполняется тест, обязательно перед тирдауном
#    print("Я выполняюсь после теста") #тирдаун постусловие
